public class Curry {
    /*
        メンバ変数宣言
        (修飾子) データ型 メンバ変数;

        変数の初期化も可能
        (修飾子) データ型 メンバ変数 = 値;
     */
//    String name = "カレー";

    /*
        メソッド定義
        (修飾子) 戻り値の型 メソッド名(引数リスト){}
        戻り値を返したい場合はreturn文をメソッド内に記述する

        戻り値がない場合はvoidを戻り値の型にする
        (修飾子) void メソッド名(引数リスト){}

     */
//    public String taste() {
//        return "スパイシーで美味しい";
//    }

    void exShow() {
        System.out.println("カレーの作り方");
    }

}

/*
このクラスは設計図であってただの部品に過ぎないのでこのクラスを参照して、実行できるクラスを別に定義する必要がある

また、このクラスのメンバ変数やメソッドを使用するためにはクラスのインスタンス化が必要(Main.java)
 */


